ahtn/keyplus/ports/efm8/efm8/mcu/EFM8LB1/inc/SI_EFM8LB1_Register_Enums.h
#define ADC0CF1_ADLPM__BMASK       0x80 ///< Low Power Mode Enable   
#define ADC0CF1_ADLPM__SHIFT       0x07 ///< Low Power Mode Enable   
#define ADC0CF1_ADLPM__LP_DISABLED 0x00 ///< Disable low power mode. 
#define ADC0CF1_ADLPM__LP_ENABLED  0x80 ///< Enable low power mode.  
                                                                     
//------------------------------------------------------------------------------
// ADC0CF2 Enums (ADC0 Power Control @ 0xDF)
//------------------------------------------------------------------------------
#define ADC0CF2_ADPWR__FMASK         0x1F ///< Power Up Delay Time                               
#define ADC0CF2_ADPWR__SHIFT         0x00 ///< Power Up Delay Time                               
                                                                                                 
#define ADC0CF2_REFSL__FMASK         0x60 ///< Voltage Reference Select                          
#define ADC0CF2_REFSL__SHIFT         0x05 ///< Voltage Reference Select                          
#define ADC0CF2_REFSL__VREF_PIN      0x00 ///< The ADC0 voltage reference is the VREF pin        
                                          ///< (external or from the on-chip reference).         
#define ADC0CF2_REFSL__VDD_PIN       0x20 ///< The ADC0 voltage reference is the VDD pin.        
#define ADC0CF2_REFSL__INTERNAL_LDO  0x40 ///< The ADC0 voltage reference is the internal 1.8 V  
                                          ///< digital supply voltage.                           
#define ADC0CF2_REFSL__INTERNAL_VREF 0x60 ///< The ADC0 voltage reference is the internal voltage
                                          ///< reference.                                        
                                                                                                 
#define ADC0CF2_GNDSL__BMASK         0x80 ///< Analog Ground Reference                           
#define ADC0CF2_GNDSL__SHIFT         0x07 ///< Analog Ground Reference                           
#define ADC0CF2_GNDSL__GND_PIN       0x00 ///< The ADC0 ground reference is the GND pin.         
#define ADC0CF2_GNDSL__AGND_PIN      0x80 ///< The ADC0 ground reference is the AGND pin.        
                                                                                                 
//------------------------------------------------------------------------------
// ADC0CN0 Enums (ADC0 Control 0 @ 0xE8)
//------------------------------------------------------------------------------
#define ADC0CN0_TEMPE__BMASK         0x01 ///< Temperature Sensor Enable                         
#define ADC0CN0_TEMPE__SHIFT         0x00 ///< Temperature Sensor Enable                         
#define ADC0CN0_TEMPE__TEMP_DISABLED 0x00 ///< Disable the Temperature Sensor.                   
#define ADC0CN0_TEMPE__TEMP_ENABLED  0x01 ///< Enable the Temperature Sensor.                    
                                                                                                 
#define ADC0CN0_ADGN__FMASK          0x06 ///< Gain Control                                      
#define ADC0CN0_ADGN__SHIFT          0x01 ///< Gain Control                                      
#define ADC0CN0_ADGN__GAIN_1         0x00 ///< The on-chip PGA gain is 1.                        
#define ADC0CN0_ADGN__GAIN_0P75      0x02 ///< The on-chip PGA gain is 0.75.                     
#define ADC0CN0_ADGN__GAIN_0P5       0x04 ///< The on-chip PGA gain is 0.5.                      
#define ADC0CN0_ADGN__GAIN_0P25      0x06 ///< The on-chip PGA gain is 0.25.                     
                                                                                                 
#define ADC0CN0_ADWINT__BMASK        0x08 ///< Window Compare Interrupt Flag                     
#define ADC0CN0_ADWINT__SHIFT        0x03 ///< Window Compare Interrupt Flag                     
#define ADC0CN0_ADWINT__NOT_SET      0x00 ///< An ADC window compare event did not occur.        
#define ADC0CN0_ADWINT__SET          0x08 ///< An ADC window compare event occurred.             
                                                                                                 
#define ADC0CN0_ADBUSY__BMASK        0x10 ///< ADC Busy                                          
#define ADC0CN0_ADBUSY__SHIFT        0x04 ///< ADC Busy                                          
#define ADC0CN0_ADBUSY__NOT_SET      0x00 ///< An ADC0 conversion is not currently in progress.  
#define ADC0CN0_ADBUSY__SET          0x10 ///< ADC0 conversion is in progress or start an ADC0   
                                          ///< conversion.                                       
                                                                                                 
#define ADC0CN0_ADINT__BMASK         0x20 ///< Conversion Complete Interrupt Flag                
#define ADC0CN0_ADINT__SHIFT         0x05 ///< Conversion Complete Interrupt Flag                
#define ADC0CN0_ADINT__NOT_SET       0x00 ///< ADC0 has not completed a conversion since the last
                                          ///< time ADINT was cleared.                           
#define ADC0CN0_ADINT__SET           0x20 ///< ADC0 completed a data conversion.                 
                                                                                                 
#define ADC0CN0_IPOEN__BMASK         0x40 ///< Idle Powered-off Enable                           
#define ADC0CN0_IPOEN__SHIFT         0x06 ///< Idle Powered-off Enable                           
#define ADC0CN0_IPOEN__ALWAYS_ON     0x00 ///< Keep ADC powered on when ADEN is 1.               
#define ADC0CN0_IPOEN__POWER_DOWN    0x40 ///< Power down when ADC is idle (not converting).     
                                                                                                 
#define ADC0CN0_ADEN__BMASK          0x80 ///< ADC Enable                                        
#define ADC0CN0_ADEN__SHIFT          0x07 ///< ADC Enable                                        
#define ADC0CN0_ADEN__DISABLED       0x00 ///< Disable ADC0 (low-power shutdown).                
#define ADC0CN0_ADEN__ENABLED        0x80 ///< Enable ADC0 (active and ready for data            
                                          ///< conversions).                                     
                                                                                                 
//------------------------------------------------------------------------------
// ADC0CN1 Enums (ADC0 Control 1 @ 0xB2)
//------------------------------------------------------------------------------
#define ADC0CN1_ADRPT__FMASK           0x07 ///< Repeat Count                             
#define ADC0CN1_ADRPT__SHIFT           0x00 ///< Repeat Count                             
#define ADC0CN1_ADRPT__ACC_1           0x00 ///< Perform and Accumulate 1 conversion.     
#define ADC0CN1_ADRPT__ACC_4           0x01 ///< Perform and Accumulate 4 conversions.    
#define ADC0CN1_ADRPT__ACC_8           0x02 ///< Perform and Accumulate 8 conversions.    
#define ADC0CN1_ADRPT__ACC_16          0x03 ///< Perform and Accumulate 16 conversions.   
#define ADC0CN1_ADRPT__ACC_32          0x04 ///< Perform and Accumulate 32 conversions.   
                                                                                          
#define ADC0CN1_ADSJST__FMASK          0x38 ///< Accumulator Shift and Justify            
#define ADC0CN1_ADSJST__SHIFT          0x03 ///< Accumulator Shift and Justify            
#define ADC0CN1_ADSJST__RIGHT_NO_SHIFT 0x00 ///< Right justified. No shifting applied.    
#define ADC0CN1_ADSJST__RIGHT_SHIFT_1  0x08 ///< Right justified. Shifted right by 1 bit. 
#define ADC0CN1_ADSJST__RIGHT_SHIFT_2  0x10 ///< Right justified. Shifted right by 2 bits.
#define ADC0CN1_ADSJST__RIGHT_SHIFT_3  0x18 ///< Right justified. Shifted right by 3 bits.
                                                                                          
#define ADC0CN1_ADBITS__FMASK          0xC0 ///< Resolution Control                       
#define ADC0CN1_ADBITS__SHIFT          0x06 ///< Resolution Control                       
#define ADC0CN1_ADBITS__10_BIT         0x00 ///< ADC0 operates in 10-bit mode.            
#define ADC0CN1_ADBITS__12_BIT         0x40 ///< ADC0 operates in 12-bit mode.            
#define ADC0CN1_ADBITS__14_BIT         0x80 ///< ADC0 operates in 14-bit mode.            
                                                                                          
//------------------------------------------------------------------------------
// ADC0CN2 Enums (ADC0 Control 2 @ 0xB3)
//------------------------------------------------------------------------------
#define ADC0CN2_ADCM__FMASK         0x0F ///< Start of Conversion Mode Select                   
#define ADC0CN2_ADCM__SHIFT         0x00 ///< Start of Conversion Mode Select                   
#define ADC0CN2_ADCM__ADBUSY        0x00 ///< ADC0 conversion initiated on write of 1 to ADBUSY.
#define ADC0CN2_ADCM__TIMER0        0x01 ///< ADC0 conversion initiated on overflow of Timer 0. 
#define ADC0CN2_ADCM__TIMER2        0x02 ///< ADC0 conversion initiated on overflow of Timer 2. 
#define ADC0CN2_ADCM__TIMER3        0x03 ///< ADC0 conversion initiated on overflow of Timer 3. 
#define ADC0CN2_ADCM__CNVSTR        0x04 ///< ADC0 conversion initiated on rising edge of       
                                         ///< CNVSTR.                                           
#define ADC0CN2_ADCM__CEX5          0x05 ///< ADC0 conversion initiated on rising edge of CEX5. 
#define ADC0CN2_ADCM__TIMER4        0x06 ///< ADC0 conversion initiated on overflow of Timer 4. 
#define ADC0CN2_ADCM__TIMER5        0x07 ///< ADC0 conversion initiated on overflow of Timer 5. 
#define ADC0CN2_ADCM__CLU0          0x08 ///< ADC0 conversion initiated on CLU0 Output.         
#define ADC0CN2_ADCM__CLU1          0x09 ///< ADC0 conversion initiated on CLU1 Output.         
#define ADC0CN2_ADCM__CLU2          0x0A ///< ADC0 conversion initiated on CLU2 Output.         
#define ADC0CN2_ADCM__CLU3          0x0B ///< ADC0 conversion initiated on CLU3 Output.         
                                                                                                
