ahtn/keyplus/ports/efm8/efm8/mcu/EFM8LB1/inc/SI_EFM8LB1_Register_Enums.h
#define DAC0CF0_EN__BMASK           0x80 ///< DAC0 Enable                                       
#define DAC0CF0_EN__SHIFT           0x07 ///< DAC0 Enable                                       
#define DAC0CF0_EN__DISABLE         0x00 ///< DAC0 is disabled and not driven at the output pin.
#define DAC0CF0_EN__ENABLE          0x80 ///< DAC0 is enabled and will drive the output pin.    
                                                                                                
//------------------------------------------------------------------------------
// DAC0CF1 Enums (DAC0 Configuration 1 @ 0x92)
//------------------------------------------------------------------------------
#define DAC0CF1_DRVGAIN__FMASK    0x03 ///< DAC0 Output Buffer Gain
#define DAC0CF1_DRVGAIN__SHIFT    0x00 ///< DAC0 Output Buffer Gain
#define DAC0CF1_DRVGAIN__GAIN_2P0 0x00 ///< DAC output gain is 2.  
#define DAC0CF1_DRVGAIN__GAIN_2P4 0x01 ///< DAC output gain is 2.4.
#define DAC0CF1_DRVGAIN__GAIN_3P0 0x02 ///< DAC output gain is 3.  
                                                                   
//------------------------------------------------------------------------------
// DAC0H Enums (DAC0 Data Word High Byte @ 0x85)
//------------------------------------------------------------------------------
#define DAC0H_DAC0H__FMASK 0xFF ///< Data Word High Byte
#define DAC0H_DAC0H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// DAC0L Enums (DAC0 Data Word Low Byte @ 0x84)
//------------------------------------------------------------------------------
#define DAC0L_DAC0L__FMASK 0xFF ///< Data Word Low Byte
#define DAC0L_DAC0L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// DAC1CF0 Enums (DAC1 Configuration 0 @ 0x93)
//------------------------------------------------------------------------------
#define DAC1CF0_UPDATE__FMASK       0x07 ///< DAC1 Update Trigger Source                        
#define DAC1CF0_UPDATE__SHIFT       0x00 ///< DAC1 Update Trigger Source                        
#define DAC1CF0_UPDATE__SYSCLK      0x00 ///< DAC1 output updates occur on every clock cycle.   
#define DAC1CF0_UPDATE__TIMER3      0x01 ///< DAC1 output updates occur on Timer 3 high byte    
                                         ///< overflow.                                         
#define DAC1CF0_UPDATE__TIMER4      0x02 ///< DAC1 output updates occur on Timer 4 high byte    
                                         ///< overflow.                                         
#define DAC1CF0_UPDATE__TIMER5      0x03 ///< DAC1 output updates occur on Timer 5 high byte    
                                         ///< overflow.                                         
#define DAC1CF0_UPDATE__CLU0        0x04 ///< DAC1 output updates occur on Configurable Logic   
                                         ///< output 0 rising edge.                             
#define DAC1CF0_UPDATE__CLU1        0x05 ///< DAC1 output updates occur on Configurable Logic   
                                         ///< output 1 rising edge.                             
#define DAC1CF0_UPDATE__CLU2        0x06 ///< DAC1 output updates occur on Configurable Logic   
                                         ///< output 2 rising edge.                             
#define DAC1CF0_UPDATE__CLU3        0x07 ///< DAC1 output updates occur on Configurable Logic   
                                         ///< output 3 rising edge.                             
                                                                                                
#define DAC1CF0_LJST__BMASK         0x20 ///< DAC1 Left Justify Enable                          
#define DAC1CF0_LJST__SHIFT         0x05 ///< DAC1 Left Justify Enable                          
#define DAC1CF0_LJST__RIGHT_JUSTIFY 0x00 ///< DAC1 input is treated as right-justified.         
#define DAC1CF0_LJST__LEFT_JUSTIFY  0x20 ///< DAC1 input is treated as left-justified.          
                                                                                                
#define DAC1CF0_RSTMD__BMASK        0x40 ///< DAC1 Reset Mode                                   
#define DAC1CF0_RSTMD__SHIFT        0x06 ///< DAC1 Reset Mode                                   
#define DAC1CF0_RSTMD__NORMAL       0x00 ///< All resets will reset DAC1 and its associated     
                                         ///< registers.                                        
#define DAC1CF0_RSTMD__PERSIST      0x40 ///< DAC1 output will persist through all resets except
                                         ///< for power-on-resets.                              
                                                                                                
#define DAC1CF0_EN__BMASK           0x80 ///< DAC1 Enable                                       
#define DAC1CF0_EN__SHIFT           0x07 ///< DAC1 Enable                                       
#define DAC1CF0_EN__DISABLE         0x00 ///< DAC1 is disabled and not driven at the output pin.
#define DAC1CF0_EN__ENABLE          0x80 ///< DAC1 is enabled and will drive the output pin.    
                                                                                                
//------------------------------------------------------------------------------
// DAC1CF1 Enums (DAC1 Configuration 1 @ 0x94)
//------------------------------------------------------------------------------
#define DAC1CF1_DRVGAIN__FMASK    0x03 ///< DAC1 Output Buffer Gain
#define DAC1CF1_DRVGAIN__SHIFT    0x00 ///< DAC1 Output Buffer Gain
#define DAC1CF1_DRVGAIN__GAIN_2P0 0x00 ///< DAC output gain is 2.  
#define DAC1CF1_DRVGAIN__GAIN_2P4 0x01 ///< DAC output gain is 2.4.
#define DAC1CF1_DRVGAIN__GAIN_3P0 0x02 ///< DAC output gain is 3.  
                                                                   
//------------------------------------------------------------------------------
// DAC1H Enums (DAC1 Data Word High Byte @ 0x8A)
//------------------------------------------------------------------------------
#define DAC1H_DAC1H__FMASK 0xFF ///< Data Word High Byte
#define DAC1H_DAC1H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// DAC1L Enums (DAC1 Data Word Low Byte @ 0x89)
//------------------------------------------------------------------------------
#define DAC1L_DAC1L__FMASK 0xFF ///< Data Word Low Byte
#define DAC1L_DAC1L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// DAC2CF0 Enums (DAC2 Configuration 0 @ 0x95)
//------------------------------------------------------------------------------
#define DAC2CF0_UPDATE__FMASK       0x07 ///< DAC2 Update Trigger Source                        
#define DAC2CF0_UPDATE__SHIFT       0x00 ///< DAC2 Update Trigger Source                        
#define DAC2CF0_UPDATE__SYSCLK      0x00 ///< DAC2 output updates occur on every clock cycle.   
#define DAC2CF0_UPDATE__TIMER3      0x01 ///< DAC2 output updates occur on Timer 3 high byte    
                                         ///< overflow.                                         
#define DAC2CF0_UPDATE__TIMER4      0x02 ///< DAC2 output updates occur on Timer 4 high byte    
                                         ///< overflow.                                         
#define DAC2CF0_UPDATE__TIMER5      0x03 ///< DAC2 output updates occur on Timer 5 high byte    
                                         ///< overflow.                                         
#define DAC2CF0_UPDATE__CLU0        0x04 ///< DAC2 output updates occur on Configurable Logic   
                                         ///< output 0 rising edge.                             
#define DAC2CF0_UPDATE__CLU1        0x05 ///< DAC2 output updates occur on Configurable Logic   
                                         ///< output 1 rising edge.                             
#define DAC2CF0_UPDATE__CLU2        0x06 ///< DAC2 output updates occur on Configurable Logic   
                                         ///< output 2 rising edge.                             
#define DAC2CF0_UPDATE__CLU3        0x07 ///< DAC2 output updates occur on Configurable Logic   
                                         ///< output 3 rising edge.                             
                                                                                                
#define DAC2CF0_LJST__BMASK         0x20 ///< DAC2 Left Justify Enable                          
#define DAC2CF0_LJST__SHIFT         0x05 ///< DAC2 Left Justify Enable                          
#define DAC2CF0_LJST__RIGHT_JUSTIFY 0x00 ///< DAC2 input is treated as right-justified.         
#define DAC2CF0_LJST__LEFT_JUSTIFY  0x20 ///< DAC2 input is treated as left-justified.          
                                                                                                
#define DAC2CF0_RSTMD__BMASK        0x40 ///< DAC2 Reset Mode                                   
#define DAC2CF0_RSTMD__SHIFT        0x06 ///< DAC2 Reset Mode                                   
#define DAC2CF0_RSTMD__NORMAL       0x00 ///< All resets will reset DAC2 and its associated     
                                         ///< registers.                                        
#define DAC2CF0_RSTMD__PERSIST      0x40 ///< DAC2 output will persist through all resets except
                                         ///< for power-on-resets.                              
                                                                                                
#define DAC2CF0_EN__BMASK           0x80 ///< DAC2 Enable                                       
#define DAC2CF0_EN__SHIFT           0x07 ///< DAC2 Enable                                       
#define DAC2CF0_EN__DISABLE         0x00 ///< DAC2 is disabled and not driven at the output pin.
#define DAC2CF0_EN__ENABLE          0x80 ///< DAC2 is enabled and will drive the output pin.    
                                                                                                
//------------------------------------------------------------------------------
// DAC2CF1 Enums (DAC2 Configuration 1 @ 0x96)
//------------------------------------------------------------------------------
#define DAC2CF1_DRVGAIN__FMASK    0x03 ///< DAC2 Output Buffer Gain
#define DAC2CF1_DRVGAIN__SHIFT    0x00 ///< DAC2 Output Buffer Gain
#define DAC2CF1_DRVGAIN__GAIN_2P0 0x00 ///< DAC output gain is 2.  
#define DAC2CF1_DRVGAIN__GAIN_2P4 0x01 ///< DAC output gain is 2.4.
#define DAC2CF1_DRVGAIN__GAIN_3P0 0x02 ///< DAC output gain is 3.  
                                                                   
//------------------------------------------------------------------------------
// DAC2H Enums (DAC2 Data Word High Byte @ 0x8C)
//------------------------------------------------------------------------------
#define DAC2H_DAC2H__FMASK 0xFF ///< Data Word High Byte
#define DAC2H_DAC2H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// DAC2L Enums (DAC2 Data Word Low Byte @ 0x8B)
//------------------------------------------------------------------------------
#define DAC2L_DAC2L__FMASK 0xFF ///< Data Word Low Byte
#define DAC2L_DAC2L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// DAC3CF0 Enums (DAC3 Configuration 0 @ 0x9A)
//------------------------------------------------------------------------------
#define DAC3CF0_UPDATE__FMASK       0x07 ///< DAC3 Update Trigger Source                        
#define DAC3CF0_UPDATE__SHIFT       0x00 ///< DAC3 Update Trigger Source                        
#define DAC3CF0_UPDATE__SYSCLK      0x00 ///< DAC3 output updates occur on every clock cycle.   
#define DAC3CF0_UPDATE__TIMER3      0x01 ///< DAC3 output updates occur on Timer 3 high byte    
                                         ///< overflow.                                         
#define DAC3CF0_UPDATE__TIMER4      0x02 ///< DAC3 output updates occur on Timer 4 high byte    
                                         ///< overflow.                                         
#define DAC3CF0_UPDATE__TIMER5      0x03 ///< DAC3 output updates occur on Timer 5 high byte    
                                         ///< overflow.                                         
#define DAC3CF0_UPDATE__CLU0        0x04 ///< DAC3 output updates occur on Configurable Logic   
                                         ///< output 0 rising edge.                             
#define DAC3CF0_UPDATE__CLU1        0x05 ///< DAC3 output updates occur on Configurable Logic   
                                         ///< output 1 rising edge.                             
#define DAC3CF0_UPDATE__CLU2        0x06 ///< DAC3 output updates occur on Configurable Logic   
                                         ///< output 2 rising edge.                             
#define DAC3CF0_UPDATE__CLU3        0x07 ///< DAC3 output updates occur on Configurable Logic   
                                         ///< output 3 rising edge.                             
                                                                                                
#define DAC3CF0_LJST__BMASK         0x20 ///< DAC3 Left Justify Enable                          
#define DAC3CF0_LJST__SHIFT         0x05 ///< DAC3 Left Justify Enable                          
#define DAC3CF0_LJST__RIGHT_JUSTIFY 0x00 ///< DAC3 input is treated as right-justified.         
#define DAC3CF0_LJST__LEFT_JUSTIFY  0x20 ///< DAC3 input is treated as left-justified.          
                                                                                                
