ahtn/keyplus/ports/efm8/efm8/mcu/EFM8LB1/inc/SI_EFM8LB1_Register_Enums.h
#define DAC3CF0_RSTMD__BMASK        0x40 ///< DAC3 Reset Mode                                   
#define DAC3CF0_RSTMD__SHIFT        0x06 ///< DAC3 Reset Mode                                   
#define DAC3CF0_RSTMD__NORMAL       0x00 ///< All resets will reset DAC3 and its associated     
                                         ///< registers.                                        
#define DAC3CF0_RSTMD__PERSIST      0x40 ///< DAC3 output will persist through all resets except
                                         ///< for power-on-resets.                              
                                                                                                
#define DAC3CF0_EN__BMASK           0x80 ///< DAC3 Enable                                       
#define DAC3CF0_EN__SHIFT           0x07 ///< DAC3 Enable                                       
#define DAC3CF0_EN__DISABLE         0x00 ///< DAC3 is disabled and not driven at the output pin.
#define DAC3CF0_EN__ENABLE          0x80 ///< DAC3 is enabled and will drive the output pin.    
                                                                                                
//------------------------------------------------------------------------------
// DAC3CF1 Enums (DAC3 Configuration 1 @ 0x9C)
//------------------------------------------------------------------------------
#define DAC3CF1_DRVGAIN__FMASK    0x03 ///< DAC3 Output Buffer Gain
#define DAC3CF1_DRVGAIN__SHIFT    0x00 ///< DAC3 Output Buffer Gain
#define DAC3CF1_DRVGAIN__GAIN_2P0 0x00 ///< DAC output gain is 2.  
#define DAC3CF1_DRVGAIN__GAIN_2P4 0x01 ///< DAC output gain is 2.4.
#define DAC3CF1_DRVGAIN__GAIN_3P0 0x02 ///< DAC output gain is 3.  
                                                                   
//------------------------------------------------------------------------------
// DAC3H Enums (DAC3 Data Word High Byte @ 0x8E)
//------------------------------------------------------------------------------
#define DAC3H_DAC3H__FMASK 0xFF ///< Data Word High Byte
#define DAC3H_DAC3H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// DAC3L Enums (DAC3 Data Word Low Byte @ 0x8D)
//------------------------------------------------------------------------------
#define DAC3L_DAC3L__FMASK 0xFF ///< Data Word Low Byte
#define DAC3L_DAC3L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// DERIVID Enums (Derivative Identification @ 0xAD)
//------------------------------------------------------------------------------
#define DERIVID_DERIVID__FMASK                0xFF ///< Derivative ID           
#define DERIVID_DERIVID__SHIFT                0x00 ///< Derivative ID           
#define DERIVID_DERIVID__EFM8LB12F64E_QFN32   0x41 ///< EFM8LB12F64E-{R}-QFN32  
#define DERIVID_DERIVID__EFM8LB12F64E_QFP32   0x42 ///< EFM8LB12F64E-{R}-QFP32  
#define DERIVID_DERIVID__EFM8LB12F64E_QSOP24  0x43 ///< EFM8LB12F64E-{R}-QSOP24 
#define DERIVID_DERIVID__EFM8LB12F64E_QFN24   0x44 ///< EFM8LB12F64E-{R}-QFN24  
#define DERIVID_DERIVID__EFM8LB12F32E_QFN32   0x45 ///< EFM8LB12F32E-{R}-QFN32  
#define DERIVID_DERIVID__EFM8LB12F32E_QFP32   0x46 ///< EFM8LB12F32E-{R}-QFP32  
#define DERIVID_DERIVID__EFM8LB12F32E_QSOP24  0x47 ///< EFM8LB12F32E-{R}-QSOP24 
#define DERIVID_DERIVID__EFM8LB12F32E_QFN24   0x48 ///< EFM8LB12F32E-{R}-QFN24  
#define DERIVID_DERIVID__EFM8LB11F32E_QFN32   0x49 ///< EFM8LB11F32E-{R}-QFN32  
#define DERIVID_DERIVID__EFM8LB11F32E_QFP32   0x4A ///< EFM8LB11F32E-{R}-QFP32  
#define DERIVID_DERIVID__EFM8LB11F32E_QSOP24  0x4B ///< EFM8LB11F32E-{R}-QSOP24 
#define DERIVID_DERIVID__EFM8LB11F32E_QFN24   0x4C ///< EFM8LB11F32E-{R}-QFN24  
#define DERIVID_DERIVID__EFM8LB11F16E_QFN32   0x4D ///< EFM8LB11F16E-{R}-QFN32  
#define DERIVID_DERIVID__EFM8LB11F16E_QFP32   0x4E ///< EFM8LB11F16E-{R}-QFP32  
#define DERIVID_DERIVID__EFM8LB11F16E_QSOP24  0x4F ///< EFM8LB11F16E-{R}-QSOP24 
#define DERIVID_DERIVID__EFM8LB11F16E_QFN24   0x50 ///< EFM8LB11F16E-{R}-QFN24  
#define DERIVID_DERIVID__EFM8LB10F16E_QFN32   0x51 ///< EFM8LB10F16E-{R}-QFN32  
#define DERIVID_DERIVID__EFM8LB10F16E_QFP32   0x52 ///< EFM8LB10F16E-{R}-QFP32  
#define DERIVID_DERIVID__EFM8LB10F16E_QSOP24  0x53 ///< EFM8LB10F16E-{R}-QSOP24 
#define DERIVID_DERIVID__EFM8LB10F16E_QFN24   0x54 ///< EFM8LB10F16E-{R}-QFN24  
#define DERIVID_DERIVID__EFM8LB12F64ES0_QFN32 0x61 ///< EFM8LB12F64ES0-{R}-QFN32
#define DERIVID_DERIVID__EFM8LB12F64ES0_QFN24 0x64 ///< EFM8LB12F64ES0-{R}-QFN24
#define DERIVID_DERIVID__EFM8LB12F32ES0_QFN32 0x65 ///< EFM8LB12F32ES0-{R}-QFN32
#define DERIVID_DERIVID__EFM8LB12F32ES0_QFN24 0x68 ///< EFM8LB12F32ES0-{R}-QFN24
#define DERIVID_DERIVID__EFM8LB11F32ES0_QFN32 0x69 ///< EFM8LB11F32ES0-{R}-QFN32
#define DERIVID_DERIVID__EFM8LB11F32ES0_QFN24 0x6C ///< EFM8LB11F32ES0-{R}-QFN24
#define DERIVID_DERIVID__EFM8LB11F16ES0_QFN32 0x6D ///< EFM8LB11F16ES0-{R}-QFN32
#define DERIVID_DERIVID__EFM8LB11F16ES0_QFN24 0x70 ///< EFM8LB11F16ES0-{R}-QFN24
#define DERIVID_DERIVID__EFM8LB10F16ES0_QFN32 0x71 ///< EFM8LB10F16ES0-{R}-QFN32
#define DERIVID_DERIVID__EFM8LB10F16ES0_QFN24 0x74 ///< EFM8LB10F16ES0-{R}-QFN24
                                                                                
//------------------------------------------------------------------------------
// DEVICEID Enums (Device Identification @ 0xB5)
//------------------------------------------------------------------------------
#define DEVICEID_DEVICEID__FMASK 0xFF ///< Device ID
#define DEVICEID_DEVICEID__SHIFT 0x00 ///< Device ID
                                                    
//------------------------------------------------------------------------------
// REVID Enums (Revision Identifcation @ 0xB6)
//------------------------------------------------------------------------------
#define REVID_REVID__FMASK 0xFF ///< Revision ID
#define REVID_REVID__SHIFT 0x00 ///< Revision ID
#define REVID_REVID__REV_A 0x00 ///< Revision A.
                                                
//------------------------------------------------------------------------------
// IT01CF Enums (INT0/INT1 Configuration @ 0xE4)
//------------------------------------------------------------------------------
#define IT01CF_IN0SL__FMASK       0x07 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__SHIFT       0x00 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN0SL__P0_1        0x01 ///< Select P0.1.              
#define IT01CF_IN0SL__P0_2        0x02 ///< Select P0.2.              
#define IT01CF_IN0SL__P0_3        0x03 ///< Select P0.3.              
#define IT01CF_IN0SL__P0_4        0x04 ///< Select P0.4.              
#define IT01CF_IN0SL__P0_5        0x05 ///< Select P0.5.              
#define IT01CF_IN0SL__P0_6        0x06 ///< Select P0.6.              
#define IT01CF_IN0SL__P0_7        0x07 ///< Select P0.7.              
                                                                      
