ahtn/keyplus/ports/efm8/efm8/mcu/EFM8LB1/inc/SI_EFM8LB1_Register_Enums.h
#define I2C0STAT_HSMODE__BMASK    0x80 ///< High Speed Mode                                 
#define I2C0STAT_HSMODE__SHIFT    0x07 ///< High Speed Mode                                 
#define I2C0STAT_HSMODE__NOT_SET  0x00 ///< A High Speed transfer is not in progress.       
#define I2C0STAT_HSMODE__SET      0x80 ///< A High Speed transfer is in progress.           
                                                                                            
//------------------------------------------------------------------------------
// EIE1 Enums (Extended Interrupt Enable 1 @ 0xE6)
//------------------------------------------------------------------------------
#define EIE1_ESMB0__BMASK     0x01 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__SHIFT     0x00 ///< SMBus (SMB0) Interrupt Enable                     
#define EIE1_ESMB0__DISABLED  0x00 ///< Disable all SMB0 interrupts.                      
#define EIE1_ESMB0__ENABLED   0x01 ///< Enable interrupt requests generated by SMB0.      
                                                                                          
#define EIE1_EMAT__BMASK      0x02 ///< Port Match Interrupts Enable                      
#define EIE1_EMAT__SHIFT      0x01 ///< Port Match Interrupts Enable                      
#define EIE1_EMAT__DISABLED   0x00 ///< Disable all Port Match interrupts.                
#define EIE1_EMAT__ENABLED    0x02 ///< Enable interrupt requests generated by a Port     
                                   ///< Match.                                            
                                                                                          
#define EIE1_EWADC0__BMASK    0x04 ///< ADC0 Window Comparison Interrupt Enable           
#define EIE1_EWADC0__SHIFT    0x02 ///< ADC0 Window Comparison Interrupt Enable           
#define EIE1_EWADC0__DISABLED 0x00 ///< Disable ADC0 Window Comparison interrupt.         
#define EIE1_EWADC0__ENABLED  0x04 ///< Enable interrupt requests generated by ADC0 Window
                                   ///< Compare flag (ADWINT).                            
                                                                                          
#define EIE1_EADC0__BMASK     0x08 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE1_EADC0__SHIFT     0x03 ///< ADC0 Conversion Complete Interrupt Enable         
#define EIE1_EADC0__DISABLED  0x00 ///< Disable ADC0 Conversion Complete interrupt.       
#define EIE1_EADC0__ENABLED   0x08 ///< Enable interrupt requests generated by the ADINT  
                                   ///< flag.                                             
                                                                                          
#define EIE1_EPCA0__BMASK     0x10 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__SHIFT     0x04 ///< Programmable Counter Array (PCA0) Interrupt Enable
#define EIE1_EPCA0__DISABLED  0x00 ///< Disable all PCA0 interrupts.                      
#define EIE1_EPCA0__ENABLED   0x10 ///< Enable interrupt requests generated by PCA0.      
                                                                                          
#define EIE1_ECP0__BMASK      0x20 ///< Comparator0 (CP0) Interrupt Enable                
#define EIE1_ECP0__SHIFT      0x05 ///< Comparator0 (CP0) Interrupt Enable                
#define EIE1_ECP0__DISABLED   0x00 ///< Disable CP0 interrupts.                           
#define EIE1_ECP0__ENABLED    0x20 ///< Enable interrupt requests generated by the        
                                   ///< comparator 0 CPRIF or CPFIF flags.                
                                                                                          
#define EIE1_ECP1__BMASK      0x40 ///< Comparator1 (CP1) Interrupt Enable                
#define EIE1_ECP1__SHIFT      0x06 ///< Comparator1 (CP1) Interrupt Enable                
#define EIE1_ECP1__DISABLED   0x00 ///< Disable CP1 interrupts.                           
#define EIE1_ECP1__ENABLED    0x40 ///< Enable interrupt requests generated by the        
                                   ///< comparator 1 CPRIF or CPFIF flags.                
                                                                                          
#define EIE1_ET3__BMASK       0x80 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__SHIFT       0x07 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__DISABLED    0x00 ///< Disable Timer 3 interrupts.                       
#define EIE1_ET3__ENABLED     0x80 ///< Enable interrupt requests generated by the TF3L or
                                   ///< TF3H flags.                                       
                                                                                          
//------------------------------------------------------------------------------
// EIE2 Enums (Extended Interrupt Enable 2 @ 0xF3)
//------------------------------------------------------------------------------
#define EIE2_ES1__BMASK      0x01 ///< UART1 Interrupt Enable                            
#define EIE2_ES1__SHIFT      0x00 ///< UART1 Interrupt Enable                            
#define EIE2_ES1__DISABLED   0x00 ///< Disable UART1 interrupts.                         
#define EIE2_ES1__ENABLED    0x01 ///< Enable UART1 interrupts.                          
                                                                                         
#define EIE2_EI2C0__BMASK    0x02 ///< I2C0 Slave Interrupt Enable                       
#define EIE2_EI2C0__SHIFT    0x01 ///< I2C0 Slave Interrupt Enable                       
#define EIE2_EI2C0__DISABLED 0x00 ///< Disable all I2C0 slave interrupts.                
#define EIE2_EI2C0__ENABLED  0x02 ///< Enable interrupt requests generated by the I2C0   
                                  ///< slave.                                            
                                                                                         
#define EIE2_ET4__BMASK      0x04 ///< Timer 4 Interrupt Enable                          
#define EIE2_ET4__SHIFT      0x02 ///< Timer 4 Interrupt Enable                          
#define EIE2_ET4__DISABLED   0x00 ///< Disable Timer 4 interrupts.                       
#define EIE2_ET4__ENABLED    0x04 ///< Enable interrupt requests generated by the TF4L or
                                  ///< TF4H flags.                                       
                                                                                         
#define EIE2_ET5__BMASK      0x08 ///< Timer 5 Interrupt Enable                          
#define EIE2_ET5__SHIFT      0x03 ///< Timer 5 Interrupt Enable                          
#define EIE2_ET5__DISABLED   0x00 ///< Disable Timer 5 interrupts.                       
#define EIE2_ET5__ENABLED    0x08 ///< Enable interrupt requests generated by the TF5L or
                                  ///< TF5H flags.                                       
                                                                                         
#define EIE2_CL0__BMASK      0x10 ///< Configurable Logic (CL0) Interrupt Enable         
#define EIE2_CL0__SHIFT      0x04 ///< Configurable Logic (CL0) Interrupt Enable         
#define EIE2_CL0__DISABLED   0x00 ///< Disable CL0 interrupts.                           
#define EIE2_CL0__ENABLED    0x10 ///< Enable interrupt requests generated by CL0.       
                                                                                         
//------------------------------------------------------------------------------
// EIP1 Enums (Extended Interrupt Priority 1 Low @ 0xBB)
//------------------------------------------------------------------------------
#define EIP1_PSMB0__BMASK  0x01 ///< SMBus (SMB0) Interrupt Priority Control LSB                     
#define EIP1_PSMB0__SHIFT  0x00 ///< SMBus (SMB0) Interrupt Priority Control LSB                     
#define EIP1_PSMB0__LOW    0x00 ///< SMB0 interrupt priority LSB set to low.                         
#define EIP1_PSMB0__HIGH   0x01 ///< SMB0 interrupt priority LSB set to high.                        
                                                                                                     
#define EIP1_PMAT__BMASK   0x02 ///< Port Match Interrupt Priority Control LSB                       
#define EIP1_PMAT__SHIFT   0x01 ///< Port Match Interrupt Priority Control LSB                       
#define EIP1_PMAT__LOW     0x00 ///< Port Match interrupt priority LSB set to low.                   
#define EIP1_PMAT__HIGH    0x02 ///< Port Match interrupt priority LSB set to high.                  
                                                                                                     
#define EIP1_PWADC0__BMASK 0x04 ///< ADC0 Window Comparator Interrupt Priority Control LSB           
#define EIP1_PWADC0__SHIFT 0x02 ///< ADC0 Window Comparator Interrupt Priority Control LSB           
#define EIP1_PWADC0__LOW   0x00 ///< ADC0 Window interrupt priority LSB set to low.                  
#define EIP1_PWADC0__HIGH  0x04 ///< ADC0 Window interrupt priority LSB set to high.                 
                                                                                                     
#define EIP1_PADC0__BMASK  0x08 ///< ADC0 Conversion Complete Interrupt Priority Control LSB         
#define EIP1_PADC0__SHIFT  0x03 ///< ADC0 Conversion Complete Interrupt Priority Control LSB         
#define EIP1_PADC0__LOW    0x00 ///< ADC0 Conversion Complete interrupt priority LSB                 
                                ///< set to low.                                                     
#define EIP1_PADC0__HIGH   0x08 ///< ADC0 Conversion Complete interrupt priority LSB                 
                                ///< set to high.                                                    
                                                                                                     
#define EIP1_PPCA0__BMASK  0x10 ///< Programmable Counter Array (PCA0) Interrupt Priority Control LSB
#define EIP1_PPCA0__SHIFT  0x04 ///< Programmable Counter Array (PCA0) Interrupt Priority Control LSB
#define EIP1_PPCA0__LOW    0x00 ///< PCA0 interrupt priority LSB set to low.                         
#define EIP1_PPCA0__HIGH   0x10 ///< PCA0 interrupt priority LSB set to high.                        
                                                                                                     
