ahtn/keyplus/ports/efm8/efm8/mcu/EFM8LB1/inc/SI_EFM8LB1_Register_Enums.h
#define PCA0CENT_CEX3CEN__BMASK  0x08 ///< CEX3 Center Alignment Enable
#define PCA0CENT_CEX3CEN__SHIFT  0x03 ///< CEX3 Center Alignment Enable
#define PCA0CENT_CEX3CEN__EDGE   0x00 ///< Edge-aligned.               
#define PCA0CENT_CEX3CEN__CENTER 0x08 ///< Center-aligned.             
                                                                       
#define PCA0CENT_CEX4CEN__BMASK  0x10 ///< CEX4 Center Alignment Enable
#define PCA0CENT_CEX4CEN__SHIFT  0x04 ///< CEX4 Center Alignment Enable
#define PCA0CENT_CEX4CEN__EDGE   0x00 ///< Edge-aligned.               
#define PCA0CENT_CEX4CEN__CENTER 0x10 ///< Center-aligned.             
                                                                       
#define PCA0CENT_CEX5CEN__BMASK  0x20 ///< CEX5 Center Alignment Enable
#define PCA0CENT_CEX5CEN__SHIFT  0x05 ///< CEX5 Center Alignment Enable
#define PCA0CENT_CEX5CEN__EDGE   0x00 ///< Edge-aligned.               
#define PCA0CENT_CEX5CEN__CENTER 0x20 ///< Center-aligned.             
                                                                       
//------------------------------------------------------------------------------
// PCA0CLR Enums (PCA Comparator Clear Control @ 0x9C)
//------------------------------------------------------------------------------
#define PCA0CLR_CPCE0__BMASK    0x01 ///< Comparator Clear Enable for CEX0                  
#define PCA0CLR_CPCE0__SHIFT    0x00 ///< Comparator Clear Enable for CEX0                  
#define PCA0CLR_CPCE0__DISABLED 0x00 ///< Disable the comparator clear function on PCA      
                                     ///< channel 0.                                        
#define PCA0CLR_CPCE0__ENABLED  0x01 ///< Enable the comparator clear function on PCA       
                                     ///< channel 0.                                        
                                                                                            
#define PCA0CLR_CPCE1__BMASK    0x02 ///< Comparator Clear Enable for CEX1                  
#define PCA0CLR_CPCE1__SHIFT    0x01 ///< Comparator Clear Enable for CEX1                  
#define PCA0CLR_CPCE1__DISABLED 0x00 ///< Disable the comparator clear function on PCA      
                                     ///< channel 1.                                        
#define PCA0CLR_CPCE1__ENABLED  0x02 ///< Enable the comparator clear function on PCA       
                                     ///< channel 1.                                        
                                                                                            
#define PCA0CLR_CPCE2__BMASK    0x04 ///< Comparator Clear Enable for CEX2                  
#define PCA0CLR_CPCE2__SHIFT    0x02 ///< Comparator Clear Enable for CEX2                  
#define PCA0CLR_CPCE2__DISABLED 0x00 ///< Disable the comparator clear function on PCA      
                                     ///< channel 2.                                        
#define PCA0CLR_CPCE2__ENABLED  0x04 ///< Enable the comparator clear function on PCA       
                                     ///< channel 2.                                        
                                                                                            
#define PCA0CLR_CPCE3__BMASK    0x08 ///< Comparator Clear Enable for CEX3                  
#define PCA0CLR_CPCE3__SHIFT    0x03 ///< Comparator Clear Enable for CEX3                  
#define PCA0CLR_CPCE3__DISABLED 0x00 ///< Disable the comparator clear function on PCA      
                                     ///< channel 3.                                        
#define PCA0CLR_CPCE3__ENABLED  0x08 ///< Enable the comparator clear function on PCA       
                                     ///< channel 3.                                        
                                                                                            
#define PCA0CLR_CPCE4__BMASK    0x10 ///< Comparator Clear Enable for CEX4                  
#define PCA0CLR_CPCE4__SHIFT    0x04 ///< Comparator Clear Enable for CEX4                  
#define PCA0CLR_CPCE4__DISABLED 0x00 ///< Disable the comparator clear function on PCA      
                                     ///< channel 4.                                        
#define PCA0CLR_CPCE4__ENABLED  0x10 ///< Enable the comparator clear function on PCA       
                                     ///< channel 4.                                        
                                                                                            
#define PCA0CLR_CPCE5__BMASK    0x20 ///< Comparator Clear Enable for CEX5                  
#define PCA0CLR_CPCE5__SHIFT    0x05 ///< Comparator Clear Enable for CEX5                  
#define PCA0CLR_CPCE5__DISABLED 0x00 ///< Disable the comparator clear function on PCA      
                                     ///< channel 5.                                        
#define PCA0CLR_CPCE5__ENABLED  0x20 ///< Enable the comparator clear function on PCA       
                                     ///< channel 5.                                        
                                                                                            
#define PCA0CLR_CPCSEL__BMASK   0x40 ///< Comparator Clear Select                           
#define PCA0CLR_CPCSEL__SHIFT   0x06 ///< Comparator Clear Select                           
#define PCA0CLR_CPCSEL__CMP_0   0x00 ///< Comparator 0 will be used for the comparator clear
                                     ///< function.                                         
#define PCA0CLR_CPCSEL__CMP_1   0x40 ///< Comparator 1 will be used for the comparator clear
                                     ///< function.                                         
                                                                                            
#define PCA0CLR_CPCPOL__BMASK   0x80 ///< Comparator Clear Polarity                         
#define PCA0CLR_CPCPOL__SHIFT   0x07 ///< Comparator Clear Polarity                         
#define PCA0CLR_CPCPOL__LOW     0x00 ///< PCA channel(s) will be cleared when comparator    
                                     ///< result goes logic low.                            
#define PCA0CLR_CPCPOL__HIGH    0x80 ///< PCA channel(s) will be cleared when comparator    
                                     ///< result goes logic high.                           
                                                                                            
//------------------------------------------------------------------------------
// PCA0CN0 Enums (PCA Control @ 0xD8)
//------------------------------------------------------------------------------
#define PCA0CN0_CCF0__BMASK   0x01 ///< PCA Module 0 Capture/Compare Flag             
#define PCA0CN0_CCF0__SHIFT   0x00 ///< PCA Module 0 Capture/Compare Flag             
#define PCA0CN0_CCF0__NOT_SET 0x00 ///< A match or capture did not occur on channel 0.
#define PCA0CN0_CCF0__SET     0x01 ///< A match or capture occurred on channel 0.     
                                                                                      
