ahtn/keyplus/ports/efm8/efm8/mcu/EFM8LB1/inc/SI_EFM8LB1_Register_Enums.h
#define PCON0_GF2__BMASK   0x10 ///< General Purpose Flag 2                          
#define PCON0_GF2__SHIFT   0x04 ///< General Purpose Flag 2                          
#define PCON0_GF2__NOT_SET 0x00 ///< The GF2 flag is not set. Clear the GF2 flag.    
#define PCON0_GF2__SET     0x10 ///< The GF2 flag is set. Set the GF2 flag.          
                                                                                     
#define PCON0_GF3__BMASK   0x20 ///< General Purpose Flag 3                          
#define PCON0_GF3__SHIFT   0x05 ///< General Purpose Flag 3                          
#define PCON0_GF3__NOT_SET 0x00 ///< The GF3 flag is not set. Clear the GF3 flag.    
#define PCON0_GF3__SET     0x20 ///< The GF3 flag is set. Set the GF3 flag.          
                                                                                     
#define PCON0_GF4__BMASK   0x40 ///< General Purpose Flag 4                          
#define PCON0_GF4__SHIFT   0x06 ///< General Purpose Flag 4                          
#define PCON0_GF4__NOT_SET 0x00 ///< The GF4 flag is not set. Clear the GF4 flag.    
#define PCON0_GF4__SET     0x40 ///< The GF4 flag is set. Set the GF4 flag.          
                                                                                     
#define PCON0_GF5__BMASK   0x80 ///< General Purpose Flag 5                          
#define PCON0_GF5__SHIFT   0x07 ///< General Purpose Flag 5                          
#define PCON0_GF5__NOT_SET 0x00 ///< The GF5 flag is not set. Clear the GF5 flag.    
#define PCON0_GF5__SET     0x80 ///< The GF5 flag is set. Set the GF5 flag.          
                                                                                     
//------------------------------------------------------------------------------
// PCON1 Enums (Power Control 1 @ 0xCD)
//------------------------------------------------------------------------------
#define PCON1_PINRSTMD__BMASK  0x01 ///< Pin Reset Mode                                    
#define PCON1_PINRSTMD__SHIFT  0x00 ///< Pin Reset Mode                                    
#define PCON1_PINRSTMD__RESET  0x00 ///< GPIO logic is reset when any reset event is       
                                    ///< asserted.                                         
#define PCON1_PINRSTMD__RETAIN 0x01 ///< Pins will retain state across any reset except for
                                    ///< power-on-reset events. Note that although pin     
                                    ///< configurations are maintained, the values of the  
                                    ///< pin control registers are reset. Registers PnMDIN,
                                    ///< PnMDOUT, Pn, and the XBARE bit may not reflect the
                                    ///< actual pin configuration at this time. New values 
                                    ///< written to these registers will take effect upon  
                                    ///< the write event.                                  
                                                                                           
#define PCON1_SUSPEND__BMASK   0x40 ///< Suspend Mode Select                               
#define PCON1_SUSPEND__SHIFT   0x06 ///< Suspend Mode Select                               
#define PCON1_SUSPEND__NORMAL  0x00 ///< Suspend mode not activated.                       
#define PCON1_SUSPEND__SUSPEND 0x40 ///< Device goes into suspend mode (high-frequency     
                                    ///< oscillators and SYSCLK are halted).               
                                                                                           
#define PCON1_SNOOZE__BMASK    0x80 ///< Snooze Mode Select                                
#define PCON1_SNOOZE__SHIFT    0x07 ///< Snooze Mode Select                                
#define PCON1_SNOOZE__NORMAL   0x00 ///< Snooze mode not activated.                        
#define PCON1_SNOOZE__SNOOZE   0x80 ///< Device goes into snooze mode (high-frequency      
                                    ///< oscillators and SYSCLK are halted, internal LDO in
                                    ///< low-power state).                                 
                                                                                           
//------------------------------------------------------------------------------
// PSTAT0 Enums (PMU Status 0 @ 0xAA)
//------------------------------------------------------------------------------
#define PSTAT0_CPT0WK__BMASK 0x01 ///< Comparator 0 Wake Flag      
#define PSTAT0_CPT0WK__SHIFT 0x00 ///< Comparator 0 Wake Flag      
                                                                   
#define PSTAT0_PMATWK__BMASK 0x02 ///< Port Match Wake Flag        
#define PSTAT0_PMATWK__SHIFT 0x01 ///< Port Match Wake Flag        
                                                                   
#define PSTAT0_TMR4WK__BMASK 0x04 ///< Timer 4 Wake Flag           
#define PSTAT0_TMR4WK__SHIFT 0x02 ///< Timer 4 Wake Flag           
                                                                   
#define PSTAT0_I2C0WK__BMASK 0x08 ///< I2C0 Slave Wake Flag        
#define PSTAT0_I2C0WK__SHIFT 0x03 ///< I2C0 Slave Wake Flag        
                                                                   
#define PSTAT0_SPI0WK__BMASK 0x10 ///< SPI0 Slave Wake Flag        
#define PSTAT0_SPI0WK__SHIFT 0x04 ///< SPI0 Slave Wake Flag        
                                                                   
#define PSTAT0_CL0WK__BMASK  0x20 ///< Configurable Logic Wake Flag
#define PSTAT0_CL0WK__SHIFT  0x05 ///< Configurable Logic Wake Flag
                                                                   
//------------------------------------------------------------------------------
// P0 Enums (Port 0 Pin Latch @ 0x80)
//------------------------------------------------------------------------------
#define P0_B0__BMASK 0x01 ///< Port 0 Bit 0 Latch                            
#define P0_B0__SHIFT 0x00 ///< Port 0 Bit 0 Latch                            
#define P0_B0__LOW   0x00 ///< P0.0 is low. Set P0.0 to drive low.           
#define P0_B0__HIGH  0x01 ///< P0.0 is high. Set P0.0 to drive or float high.
                                                                             
#define P0_B1__BMASK 0x02 ///< Port 0 Bit 1 Latch                            
#define P0_B1__SHIFT 0x01 ///< Port 0 Bit 1 Latch                            
#define P0_B1__LOW   0x00 ///< P0.1 is low. Set P0.1 to drive low.           
#define P0_B1__HIGH  0x02 ///< P0.1 is high. Set P0.1 to drive or float high.
                                                                             
